SET @start_global_value = @@global.show_binlogs_encryption;
SELECT @start_global_value;
@start_global_value
1
SELECT @@session.show_binlogs_encryption;
ERROR HY000: Variable 'show_binlogs_encryption' is a GLOBAL variable
SET GLOBAL show_binlogs_encryption=1;
SET GLOBAL show_binlogs_encryption=0;
SET GLOBAL show_binlogs_encryption=true;
SET GLOBAL show_binlogs_encryption=false;
SET GLOBAL show_binlogs_encryption=on;
SET GLOBAL show_binlogs_encryption=off;
SET GLOBAL show_binlogs_encryption=1.1;
ERROR 42000: Incorrect argument type to variable 'show_binlogs_encryption'
SET GLOBAL show_binlogs_encryption="foo";
ERROR 42000: Variable 'show_binlogs_encryption' can't be set to the value of 'foo'
SET GLOBAL show_binlogs_encryption=-1;
ERROR 42000: Variable 'show_binlogs_encryption' can't be set to the value of '-1'
RESET MASTER;
CREATE TABLE t1 (pk INT, PRIMARY KEY (pk)) ENGINE=INNODB;
INSERT INTO t1 VALUES (1);
FLUSH LOGS;
INSERT INTO t1 VALUES (2);
FLUSH LOGS;
SET GLOBAL show_binlogs_encryption=1;
SHOW MASTER LOGS;
Log_name	File_size	Encrypted
1.000001	#	No
1.000002	#	No
1.000003	#	No
SHOW MASTER LOGS WITH GTID;
Log_name	File_size	Encrypted	Prev_gtid_set
1.000001	#	No	# [empty]
1.000002	#	No	# uuid:1-2
1.000003	#	No	# uuid:1-3
SET GLOBAL show_binlogs_encryption=0;
SHOW MASTER LOGS;
Log_name	File_size	Encrypted
1.000001	#	NULL
1.000002	#	NULL
1.000003	#	No
SHOW MASTER LOGS WITH GTID;
Log_name	File_size	Encrypted	Prev_gtid_set
1.000001	#	NULL	# [empty]
1.000002	#	NULL	# uuid:1-2
1.000003	#	No	# uuid:1-3
DROP TABLE t1;
RESET MASTER;
SET GLOBAL show_binlogs_encryption = @start_global_value;
