Default value of thread_pool_on is ON
set global thread_pool_on = default;
SELECT @@global.thread_pool_on;
@@global.thread_pool_on
1
SELECT @@session.thread_pool_on;
ERROR HY000: Variable 'thread_pool_on' is a GLOBAL variable
Expected error 'Variable is a GLOBAL variable'
SET @@global.thread_pool_on = 1;
SELECT @@global.thread_pool_on;
@@global.thread_pool_on
1
SET @@global.thread_pool_on = 0;
SELECT @@global.thread_pool_on;
@@global.thread_pool_on
0
SET @@global.thread_pool_on = ON;
SELECT @@global.thread_pool_on;
@@global.thread_pool_on
1
SET @@global.thread_pool_on = OFF;
SELECT @@global.thread_pool_on;
@@global.thread_pool_on
0
SET @@global.thread_pool_on = on;
SELECT @@global.thread_pool_on;
@@global.thread_pool_on
1
SET @@global.thread_pool_on = oN;
SELECT @@global.thread_pool_on;
@@global.thread_pool_on
1
SET @@global.thread_pool_on = off;
SELECT @@global.thread_pool_on;
@@global.thread_pool_on
0
SET @@global.thread_pool_on = oFf;
SELECT @@global.thread_pool_on;
@@global.thread_pool_on
0
SET @@global.thread_pool_on = true;
SELECT @@global.thread_pool_on;
@@global.thread_pool_on
1
SET @@global.thread_pool_on = false;
SELECT @@global.thread_pool_on;
@@global.thread_pool_on
0
SET @@global.thread_pool_on =    ON    ;
SELECT @@global.thread_pool_on;
@@global.thread_pool_on
1
SET @@global.thread_pool_on = "OFF";
SELECT @@global.thread_pool_on;
@@global.thread_pool_on
0
SET @@global.thread_pool_on = "ON";
SELECT @@global.thread_pool_on;
@@global.thread_pool_on
1
SET @@global.thread_pool_on = 'off';
SELECT @@global.thread_pool_on;
@@global.thread_pool_on
0
SET @@global.thread_pool_on = -1000;
SELECT @@global.thread_pool_on;
@@global.thread_pool_on
1
SET @@global.thread_pool_on = 65530.34;
ERROR 42000: Incorrect argument type to variable 'thread_pool_on'
SET @@global.thread_pool_on = 1.0;
ERROR 42000: Incorrect argument type to variable 'thread_pool_on'
SET @@global.thread_pool_on = 9223372036854775808298374120938471234;
ERROR 42000: Incorrect argument type to variable 'thread_pool_on'
SET @@global.thread_pool_on = 2;
ERROR 42000: Variable 'thread_pool_on' can't be set to the value of '2'
SET @@global.thread_pool_on = "Test";
ERROR 42000: Variable 'thread_pool_on' can't be set to the value of 'Test'
SET @@global.thread_pool_on = "onTest";
ERROR 42000: Variable 'thread_pool_on' can't be set to the value of 'onTest'
SET @@global.thread_pool_on = " ON";
ERROR 42000: Variable 'thread_pool_on' can't be set to the value of ' ON'
SET @@global.thread_pool_on = "  ON  ";
ERROR 42000: Variable 'thread_pool_on' can't be set to the value of '  ON  '
SET @@global.thread_pool_on = "ON  ";
ERROR 42000: Variable 'thread_pool_on' can't be set to the value of 'ON  '
SET @@global.thread_pool_on = "true";
ERROR 42000: Variable 'thread_pool_on' can't be set to the value of 'true'
SET @@global.thread_pool_on = "false";
ERROR 42000: Variable 'thread_pool_on' can't be set to the value of 'false'
SET @@global.thread_pool_on = "0";
ERROR 42000: Variable 'thread_pool_on' can't be set to the value of '0'
SET @@global.thread_pool_on = "1";
ERROR 42000: Variable 'thread_pool_on' can't be set to the value of '1'
restart the server with non default value (OFF)
# restart: --thread_pool_on=0
SELECT @@global.thread_pool_on;
@@global.thread_pool_on
0
restart the server with the default value (ON)
# restart: 
SELECT @@global.thread_pool_on;
@@global.thread_pool_on
1
